# Pandas

In [1]:
import pandas as pd

## 1. Series

In [2]:
# Similiar a un array 1d
data = pd.Series([0.25,0.5,0.75,1])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
x=[0.25,0.5,0.75,1]
x

[0.25, 0.5, 0.75, 1]

In [8]:
data = pd.Series([1,2,3,4], index = ['a','b','c','d'])
data

a    1
b    2
c    3
d    4
dtype: int64

In [12]:
# leer un valor
data['b']

2

In [ ]:
# agregar un valor
data['f']=99
data

## 2. DataFrame

In [13]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [17]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8]], columns = ["col_1","col_2","col_3","col_4"])
df

   col_1  col_2  col_3  col_4
0      1      2      3      4
1      5      6      7      8

In [18]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8]])
df

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [49]:
df = pd.read_csv("C:/Users/Andres/Documents/Python Scripts/Datos/example_df.csv", encoding = 'latin-1')
df

   numero nombre_apellido sexo
0     123      Juan Peres    M
1     321   Lucia alvares    F
2      15     Carlos Hale    M
3      10     Sofia Cilar    F

In [21]:
df.shape

(4, 3)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
numero             4 non-null int64
nombre_apellido    4 non-null object
sexo               4 non-null object
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [24]:
import numpy as np
df.describe(include =[np.int64,object,float])

            numero nombre_apellido sexo
count     4.000000               4    4
unique         NaN               4    4
top            NaN   Lucia alvares    F
freq           NaN               1    1
mean    117.250000             NaN  NaN
std     145.493127             NaN  NaN
min      10.000000             NaN  NaN
25%      13.750000             NaN  NaN
50%      69.000000             NaN  NaN
75%     172.500000             NaN  NaN
max     321.000000             NaN  NaN

In [27]:
df.head(2) 
# mostrar los 2 primeros registros, si no se especifica saca los 5 primeros

   numero nombre_apellido sexo
0     123      Juan Peres    M
1     321   Lucia alvares    F

In [29]:
# Acceder a los datos
df[['nombre_apellido','sexo']]

  nombre_apellido sexo
0      Juan Peres    M
1   Lucia alvares    F
2     Carlos Hale    M
3     Sofia Cilar    F

In [31]:
df['nombre_apellido']=="Carlos Hale"

0    False
1    False
2     True
3    False
Name: nombre_apellido, dtype: bool

In [41]:
df.loc[df['nombre_apellido']=="Carlos Hale",]

   numero nombre_apellido sexo
2      25     Carlos Hale    M

In [36]:
df.loc[df['nombre_apellido']=="Carlos Hale",'numero']=25
df

   numero nombre_apellido sexo
0     123      Juan Peres    M
1     321   Lucia alvares    F
2      25     Carlos Hale    M
3      10     Sofia Cilar    F

In [40]:
#Ordenar el dataframe
df.sort_values('nombre_apellido')

   numero nombre_apellido sexo
2      25     Carlos Hale    M
0     123      Juan Peres    M
1     321   Lucia alvares    F
3      10     Sofia Cilar    F

In [43]:
df = df.sort_values('nombre_apellido')
df

   numero nombre_apellido sexo
2      25     Carlos Hale    M
0     123      Juan Peres    M
1     321   Lucia alvares    F
3      10     Sofia Cilar    F

In [45]:
# para mantener el orden de los indices

df.reset_index(drop = True, inplace = True)
df

   numero nombre_apellido sexo
0      25     Carlos Hale    M
1     123      Juan Peres    M
2     321   Lucia alvares    F
3      10     Sofia Cilar    F

In [50]:
df.groupby(by = 'sexo')['numero'].mean()

sexo
F    165.5
M     69.0
Name: numero, dtype: float64

In [51]:
df.groupby(by = 'sexo')['nombre_apellido'].count()

sexo
F    2
M    2
Name: nombre_apellido, dtype: int64

In [53]:
df.groupby(by='sexo').agg({'numero':'mean',
                        'nombre_apellido':'count'})

      numero  nombre_apellido
sexo
F      165.5                2
M       69.0                2

In [56]:
#renombrar las columnas
df.rename(columns={'numero':'num'},inplace=True)
df

   num nombre_apellido sexo
0  123      Juan Peres    M
1  321   Lucia alvares    F
2   15     Carlos Hale    M
3   10     Sofia Cilar    F